Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
    dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalForce_u16 =  normalizedPedalReading_fl32 * 65535.0f;
    dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalPosition_u16 = constrain(stepperPosFraction, 0.0f, 1.0f) * 65535.0f;
    dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.joystickOutput_u16 = (float)joystickNormalizedToInt32 / 10000.0f * 32767.0f;//65535;
    //parse_version_fast(DAP_FIRMWARE_VERSION, &dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalFirmwareVersion_u8[0], &dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalFirmwareVersion_u8[1], &dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalFirmwareVersion_u8[2]);
    dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalFirmwareVersion_u8[0]=versionMajor;
    dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalFirmwareVersion_u8[1]=versionMinor;
    dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.pedalFirmwareVersion_u8[2]=versionPatch;
    //error code
    dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.erroe_code_u8=0;
    
    //servo status update
    dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.servoStatus=stepper->servoStatus;
    
    #ifdef ESPNOW_Enable
      if(ESPNow_error_code!=0)
      {
        dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.erroe_code_u8=ESPNow_error_code;
        ESPNow_error_code=0;
      }
    #endif

    if( (stepper->getLifelineSignal()==false) && (stepper->servoStatus!=SERVO_IDLE_NOT_CONNECTED) )
    {
      dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_.erroe_code_u8=12;
    }

    //fill the header
    dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_.startOfFrame0_u8 = SOF_BYTE_0;
    dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_.startOfFrame1_u8 = SOF_BYTE_1;
    dap_state_basic_st_lcl_pedalUpdateTask.payloadFooter_.enfOfFrame0_u8 = EOF_BYTE_0;
    dap_state_basic_st_lcl_pedalUpdateTask.payloadFooter_.enfOfFrame1_u8 = EOF_BYTE_1;

    dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_.payloadType = DAP_PAYLOAD_TYPE_STATE_BASIC;
    dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_.version = DAP_VERSION_CONFIG;
    //dap_state_basic_st_lcl_pedalUpdateTask.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_)), sizeof(dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_) + sizeof(dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalState_Basic_));
    dap_state_basic_st_lcl_pedalUpdateTask.payLoadHeader_.PedalTag = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.pedal_type;        
    
    

    // update pedal states
    if(semaphore_updatePedalStates!=NULL)
    {
      if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)1)==pdTRUE) 
      {
        
        // move local structure values to global structures
        dap_state_basic_st = dap_state_basic_st_lcl_pedalUpdateTask;
        dap_state_extended_st = dap_state_extended_st_lcl_pedalUpdateTask;

        // release semaphore
        xSemaphoreGive(semaphore_updatePedalStates);
      }
    }
    else
    {
      semaphore_updatePedalStates = xSemaphoreCreateMutex();
    }

    // start profiler 8, struct exchange
    profiler_pedalUpdateTask.end(8);

    

    

    #ifdef PRINT_TASK_FREE_STACKSIZE_IN_WORDS
      if( controlTask_stackSizeIdx_u32 == 1000)
      {
        UBaseType_t stackHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
        Serial.print("StackSize (Pedal update): ");
        Serial.println(stackHighWaterMark);
        controlTask_stackSizeIdx_u32 = 0;
      }
      controlTask_stackSizeIdx_u32++;
    #endif



    profiler_pedalUpdateTask.end(0);

    // print profiler results
    profiler_pedalUpdateTask.report();
    

  }
}

  






/**********************************************************************************************/
/*                                                                                            */
/*                         joystick output task                                               */
/*                                                                                            */
/**********************************************************************************************/
#define REPETITION_INTERVAL_JOYSTICK_TASK (int64_t)10
int64_t timeNow_joystickTask_l = 0;
int64_t timePrevious_joystickTask_l = 0;
void joystickOutputTask( void * pvParameters )
{ 
  int32_t joystickNormalizedToInt32_local = 0;

  FunctionProfiler profiler_joystickOutputTask;
  profiler_joystickOutputTask.setName("JoystickOutput");
  profiler_joystickOutputTask.setNumberOfCalls(500);


  for(;;){
    // measure callback time and continue, when desired period is reached
    timeNow_joystickTask_l = millis();

    // control execution time
    int64_t timeDiff_joystick_l = ( timePrevious_joystickTask_l + REPETITION_INTERVAL_JOYSTICK_TASK) - timeNow_joystickTask_l;
    uint32_t targetWaitTime_u32 = constrain(timeDiff_joystick_l, 0, REPETITION_INTERVAL_JOYSTICK_TASK);
    delay(targetWaitTime_u32);
    timePrevious_joystickTask_l = millis();

    
    // copy global struct to local for faster and safe executiion
    DAP_config_st jut_dap_config_st = global_dap_config_class.getConfig();

    // activate profiler depending on pedal config
    if (jut_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
    {
      profiler_joystickOutputTask.activate( true );
    }
    else
    {
      profiler_joystickOutputTask.activate( false );
    }

    // start profiler 0, overall function
    profiler_joystickOutputTask.start(0);


    // obtain joystick output level
    if(semaphore_updateJoystick!=NULL)
    {
      if(xSemaphoreTake(semaphore_updateJoystick, (TickType_t)1)==pdTRUE)
      {
         //Serial.print(" 3");
        joystickNormalizedToInt32_local = joystickNormalizedToInt32;
        xSemaphoreGive(semaphore_updateJoystick);
      }
    }


    // send joystick output
    #if defined(USB_JOYSTICK) || defined(BLUETOOTH_GAMEPAD)
      if (IsControllerReady()) 
      {
        if(dap_calculationVariables_st.Rudder_status==false)
        {
          //general output
          SetControllerOutputValue(joystickNormalizedToInt32_local);
          
          #ifdef USB_JOYSTICK
            // Restart HID output if faulty behavior was detected
            JoystickSendState();
            if(!GetJoystickStatus())
            {
              RestartJoystick();
              Serial.println("HID Error, Restart Joystick...");
              //last_serial_joy_out=millis();
            }
          #endif

