Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
        }
      }
    #endif


    

    // start profiler 0, overall function
    profiler_joystickOutputTask.end(0);

    profiler_joystickOutputTask.end(0);

    // print profiler results
    profiler_joystickOutputTask.report();

    // print the execution time averaged over multiple cycles
    if (jut_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
    {
      static CycleTimer timerJoystick("Joystick cycle time");
      timerJoystick.Bump();
    }


  }
}

/**********************************************************************************************/
/*                                                                                            */
/*                         communication task                                                 */
/*                                                                                            */
/**********************************************************************************************/
uint32_t communicationTask_stackSizeIdx_u32 = 0;

#define REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US (int64_t)10000
#define REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_FAST_IN_US (int64_t)200

void IRAM_ATTR serialCommunicationTask( void * pvParameters )
{ 

  int32_t joystickNormalizedToInt32_local = 0;
  FunctionProfiler profiler_serialCommunicationTask;
  profiler_serialCommunicationTask.setName("SerialCommunication");
  profiler_serialCommunicationTask.setNumberOfCalls(500);

  int64_t timeNow_serialCommunicationTask_inUs_l = 0;
  int64_t timePrevious_serialCommunicationTask_inUs_l = 0;


  unsigned long previousTimeInUsFromExtendedStruct_u32 = 0;

  for(;;){

    DAP_config_st sct_dap_config_st = global_dap_config_class.getConfig();
                
    // measure callback time and continue, when desired period is reached

    // if DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT is set, target faster execution time for more accurate plotting 
    int64_t targetTaskRepetitionIntervall_i64 = REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US;
    if ( (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT) )
    {
      targetTaskRepetitionIntervall_i64 = REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_FAST_IN_US;
    }

    // control execution time
    timeNow_serialCommunicationTask_inUs_l = micros();
    int64_t timeDiff_serialCommunicationTask_inUs_l = ( timePrevious_serialCommunicationTask_inUs_l + targetTaskRepetitionIntervall_i64) - timeNow_serialCommunicationTask_inUs_l;
    uint32_t targetWaitTime_u32 = constrain(timeDiff_serialCommunicationTask_inUs_l, 0, targetTaskRepetitionIntervall_i64);
    delayMicroseconds(targetWaitTime_u32);
    timePrevious_serialCommunicationTask_inUs_l = micros();



    // average cycle time averaged over multiple cycles 
    if (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
    {
      static CycleTimer timerSC("SC cycle time");
      timerSC.Bump();
    }

    // activate profiler depending on pedal config
    if (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
    {
      profiler_serialCommunicationTask.activate( true );
    }
    else
    {
      profiler_serialCommunicationTask.activate( false );
    }


    // start profiler 0, overall function
    profiler_serialCommunicationTask.start(0);

    // start profiler 1, serial read
    profiler_serialCommunicationTask.start(1);


    uint16_t crc;




    //delay( SERIAL_COOMUNICATION_TASK_DELAY_IN_MS );

   
    { 
      // read serial input 
      uint8_t n = Serial.available();

      bool structChecker = true;
      
      if (n > 0)
      {
        switch (n) {

          // likely config structure 
          case sizeof(DAP_config_st):

            DAP_config_st * dap_config_st_local_ptr;
            dap_config_st_local_ptr = &sct_dap_config_st;
            Serial.readBytes((char*)dap_config_st_local_ptr, sizeof(DAP_config_st));

            // check if data is plausible
            if ( sct_dap_config_st.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_CONFIG ){ 
              structChecker = false;
              Serial.print("Payload type expected: ");
              Serial.print(DAP_PAYLOAD_TYPE_CONFIG);
              Serial.print(",   Payload type received: ");
              Serial.println(sct_dap_config_st.payLoadHeader_.payloadType);
            }

            if ( sct_dap_config_st.payLoadHeader_.version != DAP_VERSION_CONFIG ){ 
              structChecker = false;
              Serial.print("Config version expected: ");
              Serial.print(DAP_VERSION_CONFIG);
              Serial.print(",   Config version received: ");
              Serial.println(sct_dap_config_st.payLoadHeader_.version);
            }
            // checksum validation
            crc = checksumCalculator((uint8_t*)(&(sct_dap_config_st.payLoadHeader_)), sizeof(sct_dap_config_st.payLoadHeader_) + sizeof(sct_dap_config_st.payLoadPedalConfig_));
            if (crc != sct_dap_config_st.payloadFooter_.checkSum){ 
              structChecker = false;
              Serial.print("CRC expected: ");
              Serial.print(crc);
              Serial.print(",   CRC received: ");
              Serial.println(sct_dap_config_st.payloadFooter_.checkSum);

              Serial.print("Headersize: ");
              Serial.print(sizeof(sct_dap_config_st.payLoadHeader_));
              Serial.print(",    Configsize: ");
              Serial.println(sizeof(sct_dap_config_st.payLoadPedalConfig_));
            }


            // if checks are successfull, overwrite global configuration struct
            if (structChecker == true)
            {
              Serial.println("Updating pedal config");

              global_dap_config_class.setConfig(sct_dap_config_st);
              configUpdateAvailable = true; 

              #ifdef USING_BUZZER
                if(sct_dap_config_st.payLoadHeader_.storeToEeprom==1)
                {
                  Buzzer.single_beep_tone(700,100);
                }     
              #endif        
            }
            break;

