Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
    }


    #ifdef PRINT_TASK_FREE_STACKSIZE_IN_WORDS
      if( communicationTask_stackSizeIdx_u32 == 1000)
			{
				UBaseType_t stackHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
				Serial.print("StackSize (Serial communication): ");
				Serial.println(stackHighWaterMark);
				communicationTask_stackSizeIdx_u32 = 0;
			}
			communicationTask_stackSizeIdx_u32++;
    #endif

    // end profiler 2, serial send
    profiler_serialCommunicationTask.end(2);

    profiler_serialCommunicationTask.end(0);

    // print profiler results
    profiler_serialCommunicationTask.report();

  }
}



//OTA multitask
uint16_t OTA_count=0;
bool message_out_b=false;
bool OTA_enable_start=false;
uint32_t otaTask_stackSizeIdx_u32 = 0;
int OTA_update_status=99;
void OTATask( void * pvParameters )
{

  for(;;)
  {
    
    if(OTA_count>200)
    {
      message_out_b=true;
      OTA_count=0;
    }
    else
    {
      OTA_count++;
    }

    #if defined(OTA_update)  || defined(OTA_update_ESP32)
    if(OTA_enable_b)
    {
      if(message_out_b)
      {
        message_out_b=false;
        Serial1.println("OTA enable flag on");
      }
      if(OTA_status)
      {
        #ifdef OTA_update_ESP32
          server.handleClient();
        #endif
        #ifdef OTA_update
          if(OTA_update_status==0)
          {
            #ifdef USING_BUZZER
              Buzzer.play_melody_tone(melody_victory_theme, sizeof(melody_victory_theme)/sizeof(melody_victory_theme[0]),melody_durations_Victory_theme);              
            #endif
            ESP.restart();
          }
          else
          {
            #ifdef USING_BUZZER
              Buzzer.single_beep_tone(770,100);
            #endif
            #ifdef USING_LED
            pixels.setPixelColor(0,0xff,0x00,0x00);//red
            pixels.show(); 
            delay(500);
            pixels.setPixelColor(0,0x00,0x00,0x00);//no color
            pixels.show();
            delay(500);    
            #endif 
          }

        #endif
        

      }
      else
      {
        Serial.println("de-initialize espnow");
        Serial.println("wait...");
        #ifdef ESPNOW_Enable
          esp_err_t result= esp_now_deinit();
          ESPNow_initial_status=false;
          ESPNOW_status=false;
        #else
          esp_err_t result = ESP_OK;
        #endif
        delay(3000);
        if(result==ESP_OK)
        {
          OTA_status=true;
          #ifdef USING_BUZZER
            Buzzer.single_beep_tone(700,100);
          #endif 
          delay(1000);
          #ifdef OTA_update_ESP32
          ota_wifi_initialize(APhost);
          #endif
          #ifdef USING_LED
              //pixels.setBrightness(20);
              pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
              pixels.show(); 
              //delay(3000);
          #endif
          #ifdef OTA_update
          wifi_initialized(SSID,PASS);
          delay(2000);
          ESP32OTAPull ota;
          int ret;
          ota.SetCallback(OTAcallback);
          ota.OverrideBoard(CONTROL_BOARD);
          char* version_tag;
          if(_dap_OtaWifiInfo_st.wifi_action==1)
          {
            const char* str ="0.0.0";
            version_tag=new char[strlen(str) + 1];
            strcpy(version_tag, str);
            Serial.println("Force update");
          }
          else
          {
            version_tag=new char[strlen(DAP_FIRMWARE_VERSION) + 1];
            strcpy(version_tag, DAP_FIRMWARE_VERSION);
            //version_tag=DAP_FIRMWARE_VERSION;
          }
          switch (_dap_OtaWifiInfo_st.mode_select)
          {
            case 1:
              Serial.printf("Flashing to latest Main, checking %s to see if an update is available...\n", JSON_URL_main);
              ret = ota.CheckForOTAUpdate(JSON_URL_main, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
              Serial.printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
              OTA_update_status=ret;
              break;
            case 2:
              Serial.printf("Flashing to latest Dev, checking %s to see if an update is available...\n", JSON_URL_dev);
              ret = ota.CheckForOTAUpdate(JSON_URL_dev, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
              Serial.printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
              OTA_update_status=ret;
              break;
            case 3:
              Serial.printf("Flashing to Daily build, checking %s to see if an update is available...\n", JSON_URL_dev);
              ret = ota.CheckForOTAUpdate(JSON_URL_daily, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
              Serial.printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
              OTA_update_status=ret;
              break;
            default:
            break;
            delete[] version_tag; 
          }
          #endif

          delay(3000);
        }

      }
    }
    
    delay(1);
    #endif

    #ifdef PRINT_TASK_FREE_STACKSIZE_IN_WORDS
      if( otaTask_stackSizeIdx_u32 == 1000)
      {
        UBaseType_t stackHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
        Serial.print("StackSize (OTA): ");
        Serial.println(stackHighWaterMark);
        otaTask_stackSizeIdx_u32 = 0;
      }
      otaTask_stackSizeIdx_u32++;
    #endif
    delay(2);
  }
}

#ifdef ESPNOW_Enable
int ESPNOW_count=0;
int error_count=0;
int print_count=0;
int ESPNow_no_device_count=0;
bool basic_state_send_b=false;
bool extend_state_send_b=false;
uint8_t error_out;

int64_t timeNow_espNowTask_l = 0;
int64_t timePrevious_espNowTask_l = 0;
#define REPETITION_INTERVAL_ESPNOW_TASK (int64_t)2

uint Pairing_timeout=20000;
uint rudderPacketInterval=3;
uint joystickPacketInterval=2;
bool Pairing_timeout_status=false;
bool building_dap_esppairing_lcl =false;
unsigned long Pairing_state_start;
unsigned long Pairing_state_last_sending;
unsigned long Debug_rudder_last=0;
unsigned long basic_state_update_last=0;
unsigned long extend_state_update_last=0;
unsigned long rudderPacketsUpdateLast=0;
unsigned long joystickPacketsUpdateLast=0;
uint32_t espNowTask_stackSizeIdx_u32 = 0;
void ESPNOW_SyncTask( void * pvParameters )
{
  for(;;)
  {
    //if(ESPNOW_status)

