Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
      if(basic_state_send_b)
      {
        ESPNow.send_message(broadcast_mac,(uint8_t *) & dap_state_basic_st,sizeof(dap_state_basic_st));
        basic_state_send_b=false;
      }
      if(extend_state_send_b)
      {
        ESPNow.send_message(broadcast_mac,(uint8_t *) & dap_state_extended_st, sizeof(dap_state_extended_st));
        extend_state_send_b=false;
      }
      if(ESPNow_config_request)
      {
        ESPNow.send_message(broadcast_mac,(uint8_t *) & espnow_dap_config_st, sizeof(espnow_dap_config_st));
        ESPNow_config_request=false;
      }
      if(Config_update_b)
      {
        Config_update_b=false;
        #ifdef USING_BUZZER
        if (espnow_dap_config_st.payLoadHeader_.storeToEeprom == 1)
        {
          Buzzer.single_beep_tone(700, 100);
        }          
        #endif 
      }
      if(ESPNow_OTA_enable)
      {
        Serial.println("Get OTA command");
        OTA_enable_b=true;
        OTA_enable_start=true;
        ESPNow_OTA_enable=false;
      }
      if(OTA_update_action_b)
      {
        Serial.println("Get OTA command");
        OTA_enable_b=true;
        OTA_enable_start=true;
        ESPNow_OTA_enable=false;
        Serial.println("get basic wifi info");
        Serial.readBytes((char*)&_dap_OtaWifiInfo_st, sizeof(DAP_otaWifiInfo_st));
        #ifdef OTA_update
          if(_dap_OtaWifiInfo_st.device_ID == espnow_dap_config_st.payLoadPedalConfig_.pedal_type)
          {
            SSID=new char[_dap_OtaWifiInfo_st.SSID_Length+1];
            PASS=new char[_dap_OtaWifiInfo_st.PASS_Length+1];
            memcpy(SSID,_dap_OtaWifiInfo_st.WIFI_SSID,_dap_OtaWifiInfo_st.SSID_Length);
            memcpy(PASS,_dap_OtaWifiInfo_st.WIFI_PASS,_dap_OtaWifiInfo_st.PASS_Length);
            SSID[_dap_OtaWifiInfo_st.SSID_Length]=0;
            PASS[_dap_OtaWifiInfo_st.PASS_Length]=0;
            OTA_enable_b=true;
          }
          #endif

      }
      if(printPedalInfo_b)
      {
        printPedalInfo_b=false;
        /*
        char logString[200];
        snprintf(logString, sizeof(logString),
                 "Pedal ID: %d\nBoard: %s\nLoadcell shift= %.3f kg\nLoadcell variance= %.3f kg\nPSU voltage:%.1f V\nMax endstop:%lu\nCurrentPos:%d\0",
                 espnow_dap_config_st.payLoadPedalConfig_.pedal_type, CONTROL_BOARD, loadcell->getShiftingEstimate(), loadcell->getSTDEstimate(), ((float)stepper->getServosVoltage()/10.0f),dap_calculationVariables_st.stepperPosMaxEndstop,dap_calculationVariables_st.current_pedal_position);
        Serial.println(logString);
        sendESPNOWLog(logString, strnlen(logString, sizeof(logString)));
        */
        pedalInfoBuilder.BuildString(espnow_dap_config_st.payLoadPedalConfig_.pedal_type, CONTROL_BOARD, loadcell->getShiftingEstimate(), loadcell->getSTDEstimate(), ((float)stepper->getServosVoltage()/10.0f),dap_calculationVariables_st.stepperPosMaxEndstop,dap_calculationVariables_st.current_pedal_position);
        Serial.println(pedalInfoBuilder.logString);
        sendESPNOWLog(pedalInfoBuilder.logString, strnlen(pedalInfoBuilder.logString, sizeof(pedalInfoBuilder.logString)));
        pedalInfoBuilder.BuildESPNOWInfo(espnow_dap_config_st.payLoadPedalConfig_.pedal_type,rssi);
        Serial.println(pedalInfoBuilder.logESPNOWString);
        delay(3);
        sendESPNOWLog(pedalInfoBuilder.logESPNOWString, strnlen(pedalInfoBuilder.logESPNOWString, sizeof(pedalInfoBuilder.logESPNOWString)));

      }
      if(Get_Rudder_action_b)
      {
        Get_Rudder_action_b=false;
        #ifdef USING_BUZZER
        Buzzer.single_beep_tone(700,100);
        #endif
      }
      if(Get_HeliRudder_action_b)
      {
        Get_HeliRudder_action_b=false;
        #ifdef USING_BUZZER
        Buzzer.single_beep_tone(700,100);
        #endif
      }
      if(ESPNOW_BootIntoDownloadMode)
      {
        #ifdef ESPNow_S3
          Serial.println("Restart into Download mode");
          delay(1000);
          REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
          ESP.restart();
        #else
          Serial.println("Command not supported");
          delay(1000);
        #endif
        ESPNOW_BootIntoDownloadMode = false;
      }
      //send out rudder packet after rudder initialized
      if(rudderPacketsUpdateLast-millis()>rudderPacketInterval)
      {
        if((dap_calculationVariables_st.Rudder_status || dap_calculationVariables_st.helicopterRudderStatus) && (!Rudder_initializing && !HeliRudder_initializing))
        {              
          dap_rudder_sending.payloadRudderState_.pedal_position_ratio=dap_calculationVariables_st.current_pedal_position_ratio;
          dap_rudder_sending.payloadRudderState_.pedal_position=dap_calculationVariables_st.current_pedal_position;
          dap_rudder_sending.payLoadHeader_.payloadType=DAP_PAYLOAD_TYPE_ESPNOW_RUDDER;
          dap_rudder_sending.payLoadHeader_.PedalTag = espnow_dap_config_st.payLoadPedalConfig_.pedal_type;
          dap_rudder_sending.payLoadHeader_.version=DAP_VERSION_CONFIG;
          uint16_t crc=0;
          crc = checksumCalculator((uint8_t*)(&(dap_rudder_sending.payLoadHeader_)), sizeof(dap_rudder_sending.payLoadHeader_) + sizeof(dap_rudder_sending.payloadRudderState_));
          dap_rudder_sending.payloadFooter_.checkSum=crc;
          ESPNow.send_message(broadcast_mac,(uint8_t *) &dap_rudder_sending,sizeof(dap_rudder_sending));   
          //ESPNow_send=dap_calculationVariables_st.current_pedal_position; 
          //esp_err_t result =ESPNow.send_message(Recv_mac,(uint8_t *) &_ESPNow_Send,sizeof(_ESPNow_Send));                
          //if (result == ESP_OK) 
          //{
          //  Serial.println("Error sending the data");
          //}                
          if(ESPNow_Rudder_Update)
          {
            //dap_calculationVariables_st.sync_pedal_position=ESPNow_recieve;
            dap_calculationVariables_st.sync_pedal_position=dap_rudder_receiving.payloadRudderState_.pedal_position;
            dap_calculationVariables_st.Sync_pedal_position_ratio=dap_rudder_receiving.payloadRudderState_.pedal_position_ratio;
            ESPNow_Rudder_Update=false;
          }                
        }
        rudderPacketsUpdateLast=millis();
      }    
    }

    #ifdef ESPNow_debug_rudder
      if(print_count>1000)
      {
        if(dap_calculationVariables_st.Rudder_status)
        {
          Serial.print("Pedal:");
          Serial.print(espnow_dap_config_st.payLoadPedalConfig_.pedal_type);
          Serial.print(", Send %: ");
          Serial.print(dap_rudder_sending.payloadRudderState_.pedal_position_ratio);
          Serial.print(", Recieve %:");
          Serial.print(dap_rudder_receiving.payloadRudderState_.pedal_position_ratio);
          Serial.print(", Send Position: ");
          Serial.print(dap_calculationVariables_st.current_pedal_position);
          Serial.print(", % in cal: ");
          Serial.print(dap_calculationVariables_st.current_pedal_position_ratio); 
          Serial.print(", min cal: ");
          Serial.print(dap_calculationVariables_st.stepperPosMin_default); 
          Serial.print(", max cal: ");
          Serial.print(dap_calculationVariables_st.stepperPosMax_default);
          Serial.print(", range in cal: ");
          Serial.println(dap_calculationVariables_st.stepperPosRange_default); 
        }

